GigaDeviceSemiconductor/GD32VW55x_WiFi_BLE_SDK/MSDK/cloud/alicloud/include/exports/iot_export_diagnosis.h
/* WiFi Provision: 0x0400 ~ 0x04FF */
#define STATE_WIFI_BASE                             (-0x0400)
/* WiFi provision got enabled since user press switch button */
/* WiFi配网进入使能状态 */
#define STATE_WIFI_ENABLE_AWSS                      (STATE_WIFI_BASE - 0x0001)
/* WiFi L2 frame is being processed */
/* WiFi配网正在处理1个2层报文 */
#define STATE_WIFI_PROCESS_FRAME                    (STATE_WIFI_BASE - 0x0002)
/* WIFi channel is being operated */
/* WiFi配网正在进行对信道进行切换/锁定等操作 */
#define STATE_WIFI_CHAN_SCAN                        (STATE_WIFI_BASE - 0x0003)
/* Successfully connect to specified SSID with decrypted password */
/* 已使用WiFi配网接收到的密码, 连接WiFi热点成功 */
#define STATE_WIFI_CONNECT_AP_SUCCESS               (STATE_WIFI_BASE - 0x0004)
/* Failed connecting specified SSID with decrypted password */
/* 已使用WiFi配网接收到的密码, 连接WiFi热点失败 */
#define STATE_WIFI_CONNECT_AP_FAILED                (STATE_WIFI_BASE - 0x0005)
/* Should not start new round WiFi provision since last round in progress */
/* 不应启动新的一轮WiFi配网, 因为上一轮仍未结束 */
#define STATE_WIFI_IN_PROGRESS                      (STATE_WIFI_BASE - 0x0006)
/* WiFi provision stopped on request */
/* 已按用户调用API的指令, 停止了WiFi配网进程 */
#define STATE_WIFI_FORCE_STOPPED                    (STATE_WIFI_BASE - 0x0007)
/* WiFi provision is releasing resources */
/* 正在释放WiFi配网所占用的内部资源 */
#define STATE_WIFI_DESTROY                          (STATE_WIFI_BASE - 0x0008)
/* WiFi provision successfully detect hint frame */
/* WiFi配网功能已成功监听到关键信息起始标志帧 */
#define STATE_WIFI_GOT_HINT_FRAME                   (STATE_WIFI_BASE - 0x0009)
/* WiFi provision interpret information encrypt type */
/* WiFi配网中发现关键信息的加密方式是一型一密或一机一密等 */
#define STATE_WIFI_ENCRYPT_TYPE                     (STATE_WIFI_BASE - 0x000A)
/* WiFi provision ran into mismatch CRC */
/* WiFi配网中发现报文的校验和不符合预期 */
#define STATE_WIFI_CRC_ERROR                        (STATE_WIFI_BASE - 0x000B)
/* WiFi provision failed to decrypt WiFi password */
/* WiFi配网中解密WiFi热点的密码失败 */
#define STATE_WIFI_PASSWD_DECODE_FAILED             (STATE_WIFI_BASE - 0x000C)
/* WiFi provision decrypt WiFi password successfully */
/* WiFi配网中解密WiFi热点的密码成功 */
#define STATE_WIFI_PASSWD_DECODE_SUCCESS            (STATE_WIFI_BASE - 0x000D)
/* WiFi configuration statistics report, including overall time, pack number, pack lens */
/* WiFi配网中的统计信息, 比如收到包的数量, 配网时间, 收包报文的总长度*/
#define STATE_WIFI_STATISTIC                        (STATE_WIFI_BASE - 0x000E)
/* Unexpected version info from cellphone when wifi-provision */
/* 手机端发来的配网协议的版本号不符合预期 */
#define STATE_WIFI_UNEXP_PROT_VERSION               (STATE_WIFI_BASE - 0x000F)
/* Debug info during multicast wifi-provision */
/* WiFi组播配网中的调试信息 */
#define STATE_WIFI_MCAST_DEBUG                      (STATE_WIFI_BASE - 0x0010)
/* Debug info during broadcast wifi-provision */
/* WiFi包长编码的一键配网中的调试信息 */
#define STATE_WIFI_BCAST_DEBUG                      (STATE_WIFI_BASE - 0x0011)
/* Debug info during zero-config wifi-provision for enrollee */
/* WiFi零配过程中的待配方调试信息 */
#define STATE_WIFI_ZCONFIG_ENROLLEE_DEBUG           (STATE_WIFI_BASE - 0x0012)
/* The params from registar in zeroconfig Wifi Configuration is invalid */
/* WiFi零配过程中的主配方发来的参数有误 */
#define STATE_WIFI_ZCONFIG_REGISTAR_PARAMS_ERROR    (STATE_WIFI_BASE - 0x0013)
/* Debug info during zero-config wifi-provision for registar */
/* WiFi零配过程中的主配方调试信息 */
#define STATE_WIFI_ZCONFIG_REGISTAR_DEBUG           (STATE_WIFI_BASE - 0x0014)
/* Debug info of p2p mode smartconfig */
/* WiFi p2p配网过程中的调试信息 */
#define STATE_WIFI_P2P_DEBUG                        (STATE_WIFI_BASE - 0x0015)
/* Debug info of dev-ap mode wifi-provision */
/* WiFi 设备热点配网过程中的调试信息 */
#define STATE_WIFI_DEV_AP_DEBUG                     (STATE_WIFI_BASE - 0x0016)
/* WiFi provision claiming other information */
/* WiFi配网中的其它过程信息 */
#define STATE_WIFI_OTHERS                           (STATE_WIFI_BASE - 0x0017)
/* MQTT init failed */
/* WiFi配网中 MQTT初始化失败, MQTT用于零配主配方 */
#define STATE_WIFI_MQTT_INIT_FAILED                 (STATE_WIFI_BASE - 0x0018)
/* CoAP init failed */
/* WiFi配网中 CoAP 初始化失败, CoAP用于所有配网模式 */
#define STATE_WIFI_COAP_INIT_FAILED                 (STATE_WIFI_BASE - 0x0019)
/* CoAP is not inited */
/* WiFi配网中 CoAP Server 未初始化 */
#define STATE_WIFI_COAP_UNINIT                      (STATE_WIFI_BASE - 0x001A)
/* Got an invalid coap resp msg */
/* WiFi配网中 收到CoAP非法应答消息 */
#define STATE_WIFI_COAP_RSP_INVALID                 (STATE_WIFI_BASE - 0x001B)
/* Build CoAP packet failed in wifi-provision */
/* WiFi配网中 CoAP 组包失败 */
#define STATE_WIFI_COAP_PKTBLD_FAILED               (STATE_WIFI_BASE - 0x001C)
/* Got invalid MQTT msg in wifi-provision */
/* WiFi配网中 收到非法 MQTT 消息 */
#define STATE_WIFI_INVALID_MQTT_EVENT               (STATE_WIFI_BASE - 0x001D)
/* Notify devinfo for phone AP */
/* 手机热点配网广播设备信息 */
#define STATE_WIFI_SENT_DEVINFO_NOTIFY              (STATE_WIFI_BASE - 0x001E)
/* Notify connectap event */
/* WiFi配网中广播通知连接ap事件 */
#define STATE_WIFI_SENT_CONNECTAP_NOTIFY            (STATE_WIFI_BASE - 0x001F)
/* Recieve connectap state query msg */
/* WiFi配网中收到查询连接ap状态的包 */
#define STATE_WIFI_GOT_CONNECTAP_QUERY              (STATE_WIFI_BASE - 0x0020)
/* Recieve devinfo query message */
/* WiFi配网中收到查询设备信息的包(手机热点) */
#define STATE_WIFI_GOT_DEVINFO_QUERY                (STATE_WIFI_BASE - 0x0021)
/* Resp Connect AP request */
/* WiFi配网中设备回复手机查询connectap事件 */
#define STATE_WIFI_SENT_CONNECTAP_RESP              (STATE_WIFI_BASE - 0x0022)
/* Resp devinfo request */
/* WiFi配网中设备回复手机查询设备信息事件 */
#define STATE_WIFI_SENT_DEVINFO_RESP                (STATE_WIFI_BASE - 0x0023)
/* Dev AP config */
/* dev-ap already running */
/* WiFi 设备热点已经开启过, 本次为重复开启 */
#define STATE_WIFI_DEV_AP_ALREADY_RUN               (STATE_WIFI_BASE - 0x0040)
/* dev-ap start failed */
/* WiFi 设备热点开启失败 */
#define STATE_WIFI_DEV_AP_START_FAIL                (STATE_WIFI_BASE - 0x0041)
/* dev-ap receive message not in dev-ap awss mode */
/* WiFi 设备热点并未开启，但接收到了对端设备热点配网消息 */
#define STATE_WIFI_DEV_AP_RECV_IN_WRONG_STATE       (STATE_WIFI_BASE - 0x0042)
/* dev-ap received awss packet invalid */
#define STATE_WIFI_DEV_AP_RECV_PKT_INVALID          (STATE_WIFI_BASE - 0x0043)
/* dev-ap received awss packet invalid */
#define STATE_WIFI_DEV_AP_PARSE_PKT_FAIL            (STATE_WIFI_BASE - 0x0044)
/* dev-ap failed to decrypt WiFi password */
/* WiFi 热备热点解密WiFi热点的密码失败 */
#define STATE_WIFI_DEV_AP_PASSWD_DECODE_FAILED      (STATE_WIFI_BASE - 0x0045)
/* Send a coap msg failed */
/* WiFi配网中 发送CoAP消息失败 */
#define STATE_WIFI_DEV_AP_SEND_PKT_FAIL             (STATE_WIFI_BASE - 0x0046)
/* dev-ap stop failed */
/* WiFi 设备热点关闭失败 */
#define STATE_WIFI_DEV_AP_CLOSE_FAIL                (STATE_WIFI_BASE - 0x0047)

// Connect Router
/* WiFi Provision: 0x0400 ~ 0x04FF */
/* device send connect ap notify reach max count(timeout, send fail or recv no resp) */
#define STATE_WIFI_SENT_CONNECTAP_NOTI_TIMEOUT      (STATE_WIFI_BASE - 0x0060)
/* device can not find the AP to connect */
#define STATE_WIFI_AP_DISCOVER_FAIL                 (STATE_WIFI_BASE - 0x0061)
/* device find the AP rssi too low to connect */
#define STATE_WIFI_AP_RSSI_TOO_LOW                  (STATE_WIFI_BASE - 0x0062)
/* device connect the AP auth fail */
#define STATE_WIFI_AP_CONN_AUTH_FAIL                (STATE_WIFI_BASE - 0x0063)
/* device connect the AP IP Address get fail */
#define STATE_WIFI_AP_CONN_IP_GET_FAIL              (STATE_WIFI_BASE - 0x0064)

