GigaDeviceSemiconductor/GD32VW55x_WiFi_BLE_SDK/MSDK/cloud/alicloud/include/exports/iot_export_diagnosis.h
/* COAP: 0x0500 ~ 0x05FF */
#define STATE_COAP_BASE                             (-0x0500)

/* COAP: 0x0500 ~ 0x05FF */

/* HTTP: 0x0600 ~ 0x06FF */
#define STATE_HTTP_BASE                             (-0x0600)
/* Got HTTP response from server, says dynamic register request failed */
/* 使用动态注册/一型一密功能时, 从服务端返回的报文表示, 申请密钥失败 */
#define STATE_HTTP_DYNREG_FAIL_RESP                 (STATE_HTTP_BASE - 0x0001)
/* Got HTTP response from server, which contains invalid deviceSecret */
/* 使用动态注册/一型一密功能时, 从服务端返回的报文中, 解析得到的密钥不合理 */
#define STATE_HTTP_DYNREG_INVALID_DS                (STATE_HTTP_BASE - 0x0002)
/* Reserved buffer is too short when compose pre-auth HTTP request */
/* 组装预认证消息准备发给服务端时, 为HTTP上行报文预留的缓冲区太短, 不足容纳待发送内容 */
#define STATE_HTTP_PREAUTH_REQ_BUF_SHORT            (STATE_HTTP_BASE - 0x0003)
/* Reserved buffer is too short when retrieve pre-auth HTTP response */
/* 收取预认证请求的应答报文时, 为HTTP回应报文预留的缓冲区太短, 不足容纳待接收内容 */
#define STATE_HTTP_PREAUTH_INVALID_RESP             (STATE_HTTP_BASE - 0x0004)
/* Content length field does not exist in HTTP response from server */
/* 从HTTP服务器返回的报文中, 没有找到 Content-Length 字段 */
#define STATE_HTTP_RESP_MISSING_CONTENT_LEN         (STATE_HTTP_BASE - 0x0005)
/* Report preauth relative HTTP request parameters */
/* 进行HTTP预认证的过程中, 上报预认证请求的相关信息 */
#define STATE_HTTP_PREAUTH_REQ                      (STATE_HTTP_BASE - 0x0006)
/* Report preauth relative HTTP respond parameters */
/* 进行HTTP预认证的过程中, 上报预认证应答的相关信息 */
#define STATE_HTTP_PREAUTH_RSP                      (STATE_HTTP_BASE - 0x0007)
/* Preauth relative HTTP DNS parse fail */
/* HTTP init fail */
#define STATE_HTTP_NWK_INIT_FAIL                    (STATE_HTTP_BASE - 0x0040)
/* Preauth relative HTTP DNS parse fail */
/* 进行HTTP预认证的过程中, 域名解析失败 */
#define STATE_HTTP_PREAUTH_DNS_FAIL                 (STATE_HTTP_BASE - 0x0041)
/* Preauth relative HTTP timeout fail */
/* 进行HTTP预认证的过程中, 认证超时失败 */
#define STATE_HTTP_PREAUTH_TIMEOUT_FAIL             (STATE_HTTP_BASE - 0x0042)
/* Preauth relative HTTP identify auth fail */
/* 进行HTTP预认证的过程中, 认证身份失败(三元组) */
#define STATE_HTTP_PREAUTH_IDENT_AUTH_FAIL          (STATE_HTTP_BASE - 0x0043)

/* HTTP: 0x0600 ~ 0x06FF */

/* OTA: 0x0700 ~ 0x07FF */
#define STATE_OTA_BASE                              (-0x0700)
/* Read firmware version failed */
/* 在读取设备的固件版本号时失败 */
#define STATE_OTA_FIRMWARE_VER_READ_FAIL            (STATE_OTA_BASE - 0x0040)

/* OTA: 0x0700 ~ 0x07FF */

/* Bind: 0x0800 ~ 0x08FF */
#define STATE_BIND_BASE                             (-0x0800)
/* Got external token configuration */
/* 绑定功能模块接收到来自外部的Token传入 */
#define STATE_BIND_SET_APP_TOKEN                    (STATE_BIND_BASE - 0x0001)
/* Failed to initialize CoAP server in LAN */
/* 绑定功能模块未能成功开启CoAP服务, 该服务用于局域网内的token传递 */
#define STATE_BIND_COAP_INIT_FAIL                   (STATE_BIND_BASE - 0x0002)
/* Sending bind token to cloud */
/* 正在将绑定token发送给服务端 */
#define STATE_BIND_REPORT_TOKEN                     (STATE_BIND_BASE - 0x0003)
/* Sent bind token to cloud gets success response */
/* 绑定token发送给服务端后, 已得到服务端成功接收的回应 */
#define STATE_BIND_REPORT_TOKEN_SUCCESS             (STATE_BIND_BASE - 0x0004)
/* Sending bind token in LAN */
/* 正在主动将绑定token在局域网内广播 */
#define STATE_BIND_NOTIFY_TOKEN_SENT                (STATE_BIND_BASE - 0x0005)
/* Got token query request from external devices in same LAN */
/* 正在接收到同一局域网内来自其它电子设备的token查询请求 */
#define STATE_BIND_RECV_TOKEN_QUERY                 (STATE_BIND_BASE - 0x0006)
/* Responding bind token in LAN */
/* 正在响应局域网内的token查询请求, 将token发送给其它电子设备 */
#define STATE_BIND_SENT_TOKEN_RESP                  (STATE_BIND_BASE - 0x0007)
/* Got invalid MQTT respond from server after msg report */
/* mqtt信息上报给服务端后, 接收到的回应报文不合法 */
#define STATE_BIND_MQTT_RSP_INVALID                 (STATE_BIND_BASE - 0x0008)
/* Got invalid MQTT msgid from server after token report */
/* 将绑定token上报给服务端后, 接收到的回应报文msgid不是最新的*/
#define STATE_BIND_MQTT_MSGID_INVALID               (STATE_BIND_BASE - 0x0009)
/* Got invalid CoAP respond from client after token notify */
/* 将绑定token上报给手机后, 接收到的回应报文不合法 */
#define STATE_BIND_COAP_RSP_INVALID                 (STATE_BIND_BASE - 0x000A)
/* Got invalid CoAP request from external devices in same LAN */
/* 接收到来自同一局域网内其它电子设备的token查询请求, 但请求报文不合法 */
#define STATE_BIND_COAP_REQ_INVALID                 (STATE_BIND_BASE - 0x000B)
/* Assemble external token failed */
/* app token 组装失败 */
#define STATE_BIND_ASSEMBLE_APP_TOKEN_FAILED        (STATE_BIND_BASE - 0x000C)
/* Register coap topic failed */
/* 注册coap topic失败 */
#define STATE_BIND_COAP_REGISTER_FAILED             (STATE_BIND_BASE - 0x000D)
/* Token is expired, need update */
/* token过期, 需要更新 */
#define STATE_BIND_TOKEN_EXPIRED                    (STATE_BIND_BASE - 0x000E)
/* Sent unbind msg to cloud gets success response */
/* 解绑信息发送给服务端后, 已得到服务端成功接收的回应 */
#define STATE_BIND_REPORT_RESET_SUCCESS             (STATE_BIND_BASE - 0x000F)
/* Got notify msg from cloud server */
/* 收到云端推送的事件, 如绑定与解绑 */
#define STATE_BIND_RECV_CLOUD_NOTIFY                (STATE_BIND_BASE - 0x0010)
/* Bind token report to cloud and receive ack success */
#define STATE_BIND_ALREADY_RESET                    (STATE_BIND_BASE - 0x0011)
/* Bind token report to cloud reach up threshould and still failed */
#define STATE_BIND_REPORT_TOKEN_TIMEOUT             (STATE_BIND_BASE - 0x0012)
/* Device reset in progress */
#define STATE_BIND_RST_IN_PROGRESS                  (STATE_BIND_BASE - 0x0013)
/* Receive invalid mqtt message in awss state */
#define STATE_BIND_MQTT_MSG_INVALID                 (STATE_BIND_BASE - 0x0014)
/* Receive invalid coap message in awss state */
#define STATE_BIND_COAP_MSG_INVALID                 (STATE_BIND_BASE - 0x0015)
/* Not got external token configuration */
/* 绑定功能模块确认未接收到来自外部的Token传入 */
#define STATE_BIND_NO_APP_TOKEN                     (STATE_BIND_BASE - 0x0040)
/* Dev bind token already report to cloud, no need to report again */
/* 绑定功能模块确认已上报Token成功到云端，无需再重复上报 */
#define STATE_BIND_ALREADY_REPORT                   (STATE_BIND_BASE - 0x0041)
/* Sending bind token to cloud failed */
/* 将绑定token发送给服务端时失败 */
#define STATE_BIND_REPORT_TOKEN_FAIL                (STATE_BIND_BASE - 0x0042)
/* Bind token get Response to App failed */
#define STATE_BIND_APP_GET_TOKEN_RESP_FAIL          (STATE_BIND_BASE - 0x0043)
/* Sent reset msg to cloud failed */
/*  */
#define STATE_BIND_REPORT_RESET_FAIL                (STATE_BIND_BASE - 0x0044)


