GigaDeviceSemiconductor/GD32VW55x_WiFi_BLE_SDK/MSDK/cloud/alicloud/include/exports/iot_export_diagnosis.h
#ifdef DEV_ERRCODE_ENABLE
DLL_IOT_API int dev_errcode_kv_set(uint16_t err_code, char *p_msg);
DLL_IOT_API int dev_errcode_kv_get(uint16_t *p_errcode, char *p_msg);
DLL_IOT_API int dev_errcode_kv_del();

#ifdef DEV_OFFLINE_OTA_ENABLE
typedef int (*OFFLINE_OTA_UPGRADE_CB)(void *pctx, char *json);
DLL_IOT_API void dev_offline_ota_module_init(void* ota_service_ctx,OFFLINE_OTA_UPGRADE_CB cd);
DLL_IOT_API int dev_notify_offline_ota_result(int resp_code);
#endif
#endif

#ifdef DEV_OFFLINE_LOG_ENABLE
typedef enum _log_level_e
{
    LOG_LEVEL_D,
    LOG_LEVEL_I,
    LOG_LEVEL_W,
    LOG_LEVEL_E
} log_level_e;

DLL_IOT_API int diagnosis_offline_log_get(void *ctx, void *resource, void *remote, void *request);
DLL_IOT_API int diagnosis_offline_log_finish(void *ctx, void *resource, void *remote, void *request);
DLL_IOT_API int diagnosis_offline_log(log_level_e level, const char *fmt, ...);
DLL_IOT_API int diagnosis_offline_log_save_all(void);
DLL_IOT_API int diagnosis_offline_log_erase_flash_desc(void);
DLL_IOT_API int diagnosis_offline_log_deinit(void);
DLL_IOT_API int diagnosis_offline_log_state_code_handle(const int state_code, const char *state_message);
#endif

#ifdef DEV_ERRCODE_ENABLE
DLL_IOT_API int diagnosis_finish(void *ctx, void *resource, void *remote, void *request);
#endif

#ifdef DEV_STATEMACHINE_ENABLE
DLL_IOT_API dev_state_t dev_state_get();
DLL_IOT_API void dev_state_set(dev_state_t state);
DLL_IOT_API dev_awss_state_t dev_awss_state_get(dev_awss_pattern_t pattern);
DLL_IOT_API void dev_awss_state_set(dev_awss_pattern_t pattern, dev_awss_state_t awss_state);
#endif

#ifdef __cplusplus
}
#endif
#endif  /* __IOT_EXPORTS_STATE_H__ */
